3A/SE465/Data-Flow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-20 Tue 01:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Flow</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Data Flow</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org74c7173">1. Data Flow Analysis</a></li>
<li><a href="#orgbd8803c">2. Definition and Uses</a>
<ul>
<li><a href="#orgeccc8dd">2.1. Uses</a>
<ul>
<li><a href="#orgc3ef691">2.1.1. c-use</a></li>
<li><a href="#org21ba5db">2.1.2. p-use</a></li>
</ul>
</li>
<li><a href="#org9b6c577">2.2. Formalization</a></li>
</ul>
</li>
<li><a href="#orga764988">3. Data Flow Action</a>
<ul>
<li><a href="#orgcaee9ef">3.1. Checklist</a></li>
<li><a href="#org67aaf25">3.2. Data Flow Graph</a>
<ul>
<li><a href="#org2f20af9">3.2.1. Paths and Pairs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2fdfdf3">4. Data Flow Coverage</a>
<ul>
<li><a href="#org7071247">4.1. All-Definitions</a></li>
<li><a href="#org512d0ac">4.2. All-Uses</a></li>
<li><a href="#org46a989c">4.3. All-P-Uses/Some-C-Uses</a></li>
<li><a href="#org57b0587">4.4. All-C-Uses/Some-P-Uses</a></li>
<li><a href="#org581c600">4.5. All-DU-Paths</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org74c7173" class="outline-2">
<h2 id="org74c7173"><span class="section-number-2">1.</span> Data Flow Analysis</h2>
<div class="outline-text-2" id="text-1">
<p>
For CFG paths that are significant for data flow in the program:
</p>
<ul class="org-ul">
<li>focuses on the assignment of values to variables and their use</li>
<li>done by analyzing occurrences of variables
<ul class="org-ul">
<li>definition occurence: value bound to variable</li>
<li>use occurrence: value of variable is referred
<ul class="org-ul">
<li>predicate use: variable used to decide whether predicate is true</li>
<li>computational use: compute a value for defining other variables or output value</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgbd8803c" class="outline-2">
<h2 id="orgbd8803c"><span class="section-number-2">2.</span> Definition and Uses</h2>
<div class="outline-text-2" id="text-2">
<p>
Program contain variables: defined by assigning values and using in expressions
</p>

<p>
With pointers, both the pointer variable and the data it points to
must be considered.
</p>

<p>
With arrays, index variables must be considered, though only the part of the array
used neds to be considered (same for fields in a class).
</p>
</div>
<div id="outline-container-orgeccc8dd" class="outline-3">
<h3 id="orgeccc8dd"><span class="section-number-3">2.1.</span> Uses</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgc3ef691" class="outline-4">
<h4 id="orgc3ef691"><span class="section-number-4">2.1.1.</span> c-use</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Refers to uses of a variable that occur within an expression as part
of an assignment statement, in an output statement, as a parameter
within a function call, and in subscript expressions. (computational)
</p>
</div>
</div>
<div id="outline-container-org21ba5db" class="outline-4">
<h4 id="org21ba5db"><span class="section-number-4">2.1.2.</span> p-use</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Refers to the occurrence of a variable in an expression used as a condition
in a branch statement such as <code>if</code> or <code>while</code>. (predicate)
</p>
</div>
</div>
</div>
<div id="outline-container-org9b6c577" class="outline-3">
<h3 id="org9b6c577"><span class="section-number-3">2.2.</span> Formalization</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Variable definition \(d(v, n)\): value is assigned to \(v\) at node \(n\)
(LHS of assignment, input statement)
</p>

<p>
Variable use
</p>
<ul class="org-ul">
<li>c-use\((v, n)\): variable \(v\) used in a computation at node \(n\)
(RHS of assignment, argument of procedure call, output statement)</li>
<li>p-use\((v, m, n)\): variable \(v\) used in predicate from node \(m\) to \(n\)
(as part of an expression used for a decision)</li>
</ul>

<p>
Variable kill \(k(v, n)\): variable \(v\) deallocated at node \(n\)
</p>
</div>
</div>
</div>
<div id="outline-container-orga764988" class="outline-2">
<h2 id="orga764988"><span class="section-number-2">3.</span> Data Flow Action</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgcaee9ef" class="outline-3">
<h3 id="orgcaee9ef"><span class="section-number-3">3.1.</span> Checklist</h3>
<div class="outline-text-3" id="text-3-1">
<p>
For each successive pair of actions:
</p>
<ul class="org-ul">
<li>suspicious: dd</li>
<li>likely defect: dk, kk</li>
<li>defect: ku</li>
<li>okay: du, kd, ud, uk, uu</li>
</ul>

<p>
First occurrence of action on a variable:
</p>
<ul class="org-ul">
<li>suspicious: k, u (unless global)</li>
<li>okay: d</li>
</ul>

<p>
Last occurrence of action on a variable:
</p>
<ul class="org-ul">
<li>suspicious: d (defined but never used after)</li>
<li>okay: k, u (but maybe deallocation forgotten)</li>
</ul>
</div>
</div>
<div id="outline-container-org67aaf25" class="outline-3">
<h3 id="org67aaf25"><span class="section-number-3">3.2.</span> Data Flow Graph</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Captures the flow of definitions and uses across basic blocks
in a program.
Similar to a CFG in that nodes, edges, and paths in the CFG
are preserved in the DFG.
</p>
<ul class="org-ul">
<li>annotate nodes with def and c-use as needed, and each edge
with p-use as needed</li>
<li>label each edge with the condition which when true causes
the edge to be taken</li>
</ul>
</div>
<div id="outline-container-org2f20af9" class="outline-4">
<h4 id="org2f20af9"><span class="section-number-4">3.2.1.</span> Paths and Pairs</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Complete path: initial node is start node, final node
is exit node
</p>

<p>
Simple path: all nodes except possibly first and last
are distinct
</p>

<p>
Loop free path: all nodes are distinct
</p>

<p>
def-clear path with respect to \(v\): any path starting from
a node at which variable \(v\) is defined and ending at a node
at which \(v\) is used, without redefining \(v\) anywhere else
along the path
</p>

<p>
du-pair with respect to \(v\): (d, u) such that
</p>
<ul class="org-ul">
<li>d is the node where \(v\) is defined</li>
<li>u is the node ehrtr \(v\) is used</li>
<li>def-clear path with respect to \(v\) from \(d\) to \(u\)</li>
<li>also referred to as reach: def of \(v\) at d reaches the
use at u</li>
</ul>

<p>
du-path with respect to \(v\):
a path \(P = \left< n_{1}, n_{2}, \dots, n_{j}, n_{k} \right>\)
such that \(d(v, n_{1})\) and either one of the following two cases:
</p>
<ul class="org-ul">
<li>c-use of \(v\) at node \(n_{k}\) and \(P\) is a def-clear simple path
with respect to \(v\)</li>
<li>p-use of \(v\) on edge \(n_{j}\) to \(n_{k}\) and
\(\left< n_{1}, n_{2}, \dots, n_{j} \right>\) is a def-clear
loop-free path</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org2fdfdf3" class="outline-2">
<h2 id="org2fdfdf3"><span class="section-number-2">4.</span> Data Flow Coverage</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7071247" class="outline-3">
<h3 id="org7071247"><span class="section-number-3">4.1.</span> All-Definitions</h3>
<div class="outline-text-3" id="text-4-1">
<p>
At least one def-clear path from every defining node of \(v\)
to at least one use of \(v\), be that a c-use or p-use
</p>
</div>
</div>
<div id="outline-container-org512d0ac" class="outline-3">
<h3 id="org512d0ac"><span class="section-number-3">4.2.</span> All-Uses</h3>
<div class="outline-text-3" id="text-4-2">
<p>
At least on def-clear path form every defining node of \(v\)
to every (reachable) use of \(v\)
</p>
</div>
</div>
<div id="outline-container-org46a989c" class="outline-3">
<h3 id="org46a989c"><span class="section-number-3">4.3.</span> All-P-Uses/Some-C-Uses</h3>
<div class="outline-text-3" id="text-4-3">
<p>
At least one def-clear path from every defining node of \(v\)
to every reachable p-use of \(v\)
</p>
<ul class="org-ul">
<li>if none, then to a c-use</li>
</ul>
</div>
</div>
<div id="outline-container-org57b0587" class="outline-3">
<h3 id="org57b0587"><span class="section-number-3">4.4.</span> All-C-Uses/Some-P-Uses</h3>
<div class="outline-text-3" id="text-4-4">
<p>
At least one def-clear path from every defining node of \(v\)
to every reachable c-use of \(v\)
</p>
<ul class="org-ul">
<li>if none, then to a p-use</li>
</ul>
</div>
</div>
<div id="outline-container-org581c600" class="outline-3">
<h3 id="org581c600"><span class="section-number-3">4.5.</span> All-DU-Paths</h3>
<div class="outline-text-3" id="text-4-5">
<p>
All du paths covered
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-20 Tue 01:25</p>
</div>
</body>
</html>
